Get or set the number of the beams in a beam system.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public int NumberOfLines { get; set; }
  Visual Basic
Public Property NumberOfLines As Integer
	Get
	Set
  Visual C++
public:
property int NumberOfLines {
	int get ();
	void set (int value);
}
 Remarks
 The number must be positive.
 See Also
  LayoutRuleFixedNumber Class
  Autodesk.Revit.DB Namespace